#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <time.h>

/*
//算术操作符
int main()
{
    //除法操作符和取模
    int a = 5 / 2; //商2余1,得到2（整形），想要得小数，至少让分子或分母位小数
    printf("%d\n", a);
    int b = 5 % 2; //余1，得到1，只能适用于整数
    printf("%d\n", b);
    double c = 5.0 / 2; //浮点型
    printf("%f\n", c);  //打印浮点型，默认答应6位小数

    return 0;
}


//移位操作符
int main()
{
    int a = -16; //2的四次方
    //>>右移操作符
    //移动的是二进制位，16的二进制是10000；a是整形，四个字节 需要补充即为0000000000001000
    //测试时算术位移还是逻辑位移，原值需要为负数。
    //算术右移：右边丢掉，左边补上原本的符号值。
    //逻辑右移：右边丢弃，左边补0；
    int b = a >> 1; //2的三次方
    printf("%d\n", b);

    int c = -1;
    //>>右移操作符
    //
    //整数的二进制表示有，源码，反码，补码；
    //存储到内存的是补码；
    //-1的源码：100000000000000000000001；
    //-1的反码：111111111111111111111110；符号位不变，其他位按位取反
    //-1的补码：111111111111111111111111；反码+1
    int d = c >> 1; //2的三次方
    printf("%d\n", d);
    return 0;
    //<<左移，左边丢弃，右边补0；只有这一个规则；
    //右移有除2的效果，左移右乘2的效果；
}


//位操作符
int main()
{
    //&按位与；有0存0，全1取1；
    int a = 3;     //在内存中有32位整形位，16进制位011，2进制为00000000000000000000000000000000000000011
    int b = 5;     //16进制位101，2进制位00000000000000000000000000000000000000101
    int c = a & b; //得001
    printf("%d\n", c);
    //｜按位或；有1取1，全1取1；
    int d = 3;
    int e = 5;
    int f = d | e;
    printf("%d\n", f);
    //^按位异或；相同为0，不同为1；

    return 0;
}

//不使用临时变量，交换两个变量的值；
int main()
{
    int a = 3;
    int b = 5;
    //异或的方法
    a = a ^ b;
    //011^101=110
    b = a ^ b;
    //110^101=011
    a = a ^ b;
    //110^011=101
    return 0;
}


//编写代码，求一个整数储存在二进制内存中1的个数
int main()
{

    int a = 0;
    int b = 0;
    scanf("%d", &a);
    //统计a的二进制补码中有几个1
    //利用右移操作符与按异或
    //将值一个一个移过去，然后与1异或相同就等于1，让b加一次。
    int i = 0;
    for (i = 0; i < 32; i++)
    {
        if (1 == ((a >> i) & 1))
        {
            b++;
        }
    }

    //存在问题，-1不能求值；
    // while (a)
    // {
    //     if (a % 2 == 1)
    //         b++;
    //     a = a / 2;
    // }

    printf("%d\n", b);

    return 0;
}


//赋值操作符
int main()
{
    int a = 2;
    //以下两个相等
    a = a + 2; //赋值法
    a += 2;    //复合赋值法
    //以下两个相等
    a = a >> 1;
    a >>= 1;
    //以下两个相等
    a = a & 1;
    a &= 1;
    return 0;
}


//单目操作符
//！ - + & sizeof求变量所占内容空间的大小，单位是字节（里面的表达式不参与计算） ~对一个数的二进制按位取反 -- ++ *间接访问操作符（解引用操作符）   （类型）强制类型转换
int main()
{
    //!逻辑反操作,把真变为假，把假变为真，
    int a = 2;
    printf("%d\n", !a);
    int b = 4;
    b = ~b;
    printf("%d\n", b);

    //将11的二进制1011第三位换为1，即换成1111.
    int e = 11;
    e = e | (1 << 2);
    printf("%d\n", e);
    //再改回去既将1111改成1011；
    e = e & (~(1 <<));
    printf("%d\n", e);

    int i = 10;
    int *p = &i; //取地址符；
    *p = 20;     //解引用操作符
    printf("%d\n", i);

    short s = 0;
    int c = 4;
    printf("%d\n", sizeof(s = c + 5));
    printf("%d\n", s);
    //short是短整形，大小为2；

    //前置++与后置++
    int f = 11;
    printf("%d\n", ++a); //先使用后加，打印为12
    printf("%d\n", a++); //先加后使用，打印为11
    return 0;
}

//关系操作符  < > <= >= !=不等于  ==等于

//逻辑操作符  &&逻辑与 (左边如果算出的结果为假，那么右边都不进行计算) ｜｜逻辑或（左边如果算出的结果为真，那么右边都不进行计算了）
int main()
{
    int a = 3;
    int b = 5;
    int d = a & b;
    int c = a && b;
    printf("%d\n", d);
    printf("%d\n", c);

    return 0;
}


//条件操作符    exp1 ? exp2  : exp3
int main()
{
    int a = 0;
    int b = 0;
    if (a > 5)
    {
        b = 3;
    }
    else
        b = -3;
    printf("%d\n", b);

    //条件操作符
    b = (a > 5 ? 3 : -3);
    printf("%d\n", b);
    return 0;
}

*/
//逗号表达式
//用逗号隔开的多个表达式，从左到右依次执行。整个表达式的结果是最后一个表达式的结果。

//下标引用（一个数组名+一个索引值）、函数调用（调用函数的时候的（）就是函数调用的操作符）、结构成员（访问一个结构的成员；。结构体成员名；->结构体指针->成员名）

//比如学生
//创建了一个结构题类型
struct Stu
{
    char name[10];
    int age;
    char id[20];
};

int main()
{
    int a = 0;

    //使用struct stu这个类型创建了一个学生对象叫s1，并初始化
    struct Stu s1 = {"张三", 20, "231412123"}; //需要用打括号来书写
    printf("%s\n", s1.name);                   //使用s1里面的name
    //结构体变量。成员名

    struct Stu*ps =&s1;
   printf("%s\n",(*ps).name);
   //可以精简为(结构体指针->成员名)
   printf("%s\n",ps->name);
    
    return 0;
}

//整形提升，算术转换。看课件第五节